rust/rust异步.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-27 Thu 12:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rust异步</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">rust异步</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a53203">概览</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1a53203" class="outline-2">
<h2 id="org1a53203">概览</h2>
<div class="outline-text-2" id="text-org1a53203">
<p>
rust的异步由几个关键字组成async/await/Future等，但是看了官方文档，真是像吞粪一样，太晦涩难懂，于是参考其他语言的async,await才把这个关键搞懂。
rust的协程和go有很大的出入，其实现方式和java中的，js中的都非常类似，首先要弄懂其协程，就要先搞懂aysnc,await的含义。
简单来说，async是修饰一个函数，使其成为异步函数，如
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #F92672;">use</span> <span style="color: #AE81FF;">std</span>::{thread,time};
<span style="color: #F92672;">async</span> <span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">test</span>(){
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>,<span style="color: #E6DB74;">"&#25105;&#21518;&#25191;&#34892;"</span>);
}

<span style="color: #F92672;">fn</span> <span style="color: #A6E22E;">main</span>(){
    test();
    <span style="color: #F92672;">println!</span>(<span style="color: #E6DB74;">"</span><span style="color: #E6DB74; font-style: italic;">{}</span><span style="color: #E6DB74;">"</span>,<span style="color: #E6DB74;">"&#25105;&#20808;&#25191;&#34892;"</span>); <span style="color: #75715E;">// </span><span style="color: #75715E;">&#20808;&#25191;&#34892;&#27492;&#22788;</span>
    <span style="color: #F92672;">let</span> <span style="color: #FD971F;">one_second</span> = <span style="color: #AE81FF;">time</span>::<span style="color: #66D9EF;">Duration</span>::from_millis(1000);
    <span style="color: #AE81FF;">thread</span>::sleep(one_second);
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: qxg</p>
<p class="date">Created: 2019-06-27 Thu 12:58</p>
<p class="validation"></p>
</div>
</body>
</html>
